{"meta":{"title":"zzyyqq1","subtitle":"","description":"","author":"zzyyqq1","url":"https://zzyyqq2000.github.io","root":"/"},"pages":[{"title":"about","date":"2021-10-29T11:59:34.000Z","updated":"2021-10-29T12:00:58.366Z","comments":true,"path":"about/index.html","permalink":"https://zzyyqq2000.github.io/about/index.html","excerpt":"","text":"关于我爱折腾，兴趣广泛 喜欢围棋，羽毛球篮球之前经常玩，现在打的少 关于工作学生党 关于学习本科光电子相关专业，物理、电子信息、光学、半导体大杂烩估计接下来会读研读博 联系我 Home: zzyyqq1.top GitHub: zzyyqq2000"}],"posts":[{"title":"mathtest","slug":"mathtest","date":"2021-10-29T13:52:36.000Z","updated":"2021-10-29T14:43:41.199Z","comments":true,"path":"2021/10/29/mathtest/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/mathtest/","excerpt":"","text":"this is A test f([\\frac{1+\\{x,y\\}}{(\\frac{x}{y}+\\frac{y}{x})(u+1)}+a]^{3\\2}) \\begin{eqnarray} \\nabla\\cdot\\vec{E} &=& \\frac{\\rho}{\\epsilon_0} \\\\ \\nabla\\cdot\\vec{B} &=& 0 \\\\ \\nabla\\times\\vec{E} &=& -\\frac{\\partial B}{\\partial t} \\\\ \\nabla\\times\\vec{B} &=& \\mu_0\\left(\\vec{J}+\\epsilon_0\\frac{\\partial E}{\\partial t} \\right) \\end{eqnarray}","categories":[],"tags":[{"name":"test","slug":"test","permalink":"https://zzyyqq2000.github.io/tags/test/"}]},{"title":"踩坑记录","slug":"踩坑记录","date":"2021-10-29T03:07:28.000Z","updated":"2021-10-29T13:09:19.288Z","comments":true,"path":"2021/10/29/踩坑记录/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/%E8%B8%A9%E5%9D%91%E8%AE%B0%E5%BD%95/","excerpt":"","text":"1. 数学公示不显示解决方法为在title下面加上1mathjax：true 2. 图片无法加载以下为解决方法 第一步：下载相应插件1npm install hexo-asset-image --save 第二步：修改hexo配置将_config.yml里的post_asset_folder:false这个选项改为true由此，以后每回通过hexo new &quot;xxxxx&quot;创建新博客时都会创建一个同名文件夹，其目录结构如下1234source&#x2F;_post||--------------------xxxxx.md|--------------------xxxxx（文件夹内放入图片） 第三步：修改hexo-asset-image插件配置使用npm install hexo-asset-image --save命令下载的是hexo-asset-image@1.0.0版本插件，此插件在渲染图片时会将路径设为云端路径，使图片无法显示。需手动改回本地相对路径。更改方法为打开\\node_modules\\hexo-asset-image\\index.js文件，将其中的$(this).attr(&#39;src&#39;, config.root + link + src);改为$(this).attr(&#39;src&#39;, &#39;.&#39;+ config.root + src); 其实也可以直接npm install https://github.com/CodeFalling/hexo-asset-image --save,这样下载后的版本为hexo-asset-image@0.0.5,无需更改js文件便可正确设置路径。本人由于已经下载了1.0.0版本，不想卸载再重新安装，所以才采取直接修改js文件的方法。两种方法都行。 第四步：在文章中插入图片插入格式为：1![01](xxxxx&#x2F;01.png)xxxxx为md文件名，即储存图片的文件夹名称（它俩一个名） Bingo！！！","categories":[],"tags":[{"name":"踩坑","slug":"踩坑","permalink":"https://zzyyqq2000.github.io/tags/%E8%B8%A9%E5%9D%91/"}]},{"title":"laser modulation","slug":"laser-modulation","date":"2021-10-29T02:06:07.000Z","updated":"2021-10-29T13:07:50.120Z","comments":true,"path":"2021/10/29/laser-modulation/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/laser-modulation/","excerpt":"","text":"opinion of laser modulation technique opinion about the article: http://dx.doi.org/10.1070/QEL16297 about the articleintroductionfirst to introduce the advantages of AO modulator:small switching times,simplicity,ease of use, relatively low cost,great variety of modifications,optimisation for specific task, required wavelength,wide operating spectrum range next to say the limit:have to have the high radiation resistance, only leave quartz to choose, but quartz is not of high AO quality. So have to use high-frequency (HF) control signal of high power (up to 100 W), and lead to the need for water-cooling, which is complicated. Then say what to do:need to develop a modulator with high radiation resistance without water cooling system last talk about KYW and introduce the following contexthigh radiation resistance,transparency for light in a wide spectral range (0.4–5 mm) good to control high power radiation, more efficient, next to compare Structure and features of AO modulators made of KYWintroduce the mutual orientation of the axes of the coordinate systems of KYW two geometries: two polarisation light direction: close to the second-order symmetry axis Y of the crystal wave direction: in the direction of the Z^0^ axis(($\\phi = 0°$)) ensure close and sufficiently large M2 values for light of both polarisations most effecient(the greatest value of the AO figure-of-merit M~2~) propagation in the plane Z’Y, which is obtainedby the rotation of the plane Z^0^Y by the angle of –30°($\\phi = -30°$) around the Y axis and light should be polarised along the Z^0^ axis piezotransducer is applied are orientednormally to the optical axes other propertiesthe acoustic wave walk-off angle is small: 3.4° and 1.6°velocities of acoustic waves at j = –30° and 0 are equal to 4.56´105 and 4.79´105 cm s–1 Investigating the characteristics of modulatorsfirst stageuse 632.8-nm helium–neon laser with circular polarisationdiffraction coefficient T: $ T = sin^2 [(\\pi /2) \\sqrt{P/P_0 }]$diffraction efficiency of AO modulators: $ \\omega = T / P|_{T&lt;&lt;1} = \\pi^2 /4 P_0 $ second stageusing the same optical scheme with the aim of comparison with the existing analoguesmeasure diffraction efficiency of the commercially available MZ-321compare it with new KYW modulator KYW exceed much (3.7 and 6.6 times) but the result may not be fully correct for the MZ-321 has much longer AO interac\u0002tion length and makes the estimate obtained not completely correct and the ultrasonic converters are different when all condition same:exceed 5.1 and 9.2 times, same with calculation compare with paratellurite (TeO2):thought efficiency is smaller for 2-3 times but the radiation strength of TeO2 is much lowerbreaking pulse threshold for paratellurite: 0.3 GW cm^–2^ at wavelength of 1 mmbreaking pulse threshold for KGd(WO4)2: 50GW cm^–2^ (KGW)breaking pulse threshold for KYW: 0.8GW cm^–2^for high power laser, KYW is better(though not very much) Conclusionsexperiment and calculation confirm: exceeds the efficiency of a typical AO quartz modulator by approximately 10 times modulators made of KYW provide approxi\u0002mately equal diffraction efficiencies for both polarisationcomponents of the light beam, which allows nonpolarisedradiation to be modulated without significant losses.(five times.) do not require water cooling, about what i learnlaser modulation can be categroied as follow:123456789101112modulation|---- by position| |---- internal modulation| |---- external modulation|---- by feature | |---- laser as wave| |---- amplitude modulation| |---- phase modulation| |---- frequency modulation| |---- laser as pulse| |---- pulse modualtion| |---- pulse coded modulation(digital modulation)","categories":[],"tags":[{"name":"idea","slug":"idea","permalink":"https://zzyyqq2000.github.io/tags/idea/"}]},{"title":"激光调制器","slug":"激光调制器","date":"2021-10-29T02:01:41.000Z","updated":"2021-10-29T13:10:18.657Z","comments":true,"path":"2021/10/29/激光调制器/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/%E6%BF%80%E5%85%89%E8%B0%83%E5%88%B6%E5%99%A8/","excerpt":"","text":"“难用的”激光调制器件 本人对激光调制器件使用的最大感受便是——难用，本文浅谈为什么会有此种感受，以及破解之道 一、总括经过学习与在实验室里的实践之后，我得到了对于激光调制器件最直观的感受——难用，很难用。为搞清楚为什么使用起来如此困难，首先我开始反思自身能力问题。发现自身存在很严重的纸上谈兵情况，只是在课堂上学习了器件的原理，距离实际使用之间相差甚远。但另一方面，除能力有限外，激光调制器件本身也确实很难用。这里的难用是相比较于电子器件，如运算放大器等。在实验室跟随学姐做电光调Q与声光调Q的过程中，总会遇到与理论严重不符无法解释的状况，令人非常头痛。 二、分析1. 思路梳理在各种“高谈阔论”开始之前，有必要明确，到底什么是激光调制？课本上的定义为： 激光调制为利用激光作为载波的调制。 更直白的说，即为：对激光进行的调制。 对激光调制的研究大抵都会从分类开始，教材中给出的激光调制的分类方式如下：123456789101112激光调制|---- 按位置分| |---- 内调制| |---- 外调制|---- 按性质分 | |---- 模拟调制| |---- 振幅调制| |---- 相位调制| |---- 频率调制| |---- 数字调制| |---- 脉冲调制| |---- 脉冲编码调制此外，我认为还可以按照调制的手段进行分类，将激光调制分为： 声光调制 电光调制 磁光调制 此种分类方法更着重强调调制的宏观方法，且与上述分类方法可以混用，如电光调制既可以是振幅调制，也可以是相位调制。 接下来，我便以自身的实验经历与所阅读的文献，展开讨论我对激光调制及器件的看法。 2. 与电子器件的对比评价一个器件好不好用，我觉得需要将其放入使用的系统中进行综合考量。评价一个激光调制器件好不好用，我觉得最好的方法是与电子器件进行对比。 首先考虑系统的搭建难度：电子器件可以在面包板上进行操作，小巧而且不容易出现问题，器件与器件之间更是直接通过导线相连便可。反观光学系统，需要在专门的试验台上搭建系统，便捷性大大降低，而且器件与器件之间的连接需要手动准直以保证光线顺利通过。其准直步骤极其繁琐而且不易操作。我在实验室中跟随学姐进行实验前都需要花费很长时间对光具组进行准直，而且实验过程中若无意碰到或者根据需要挪动光学器件后还需重新准直，耗费大量时间精力。 其次是系统设计方面的难度：使用电子器件的某中功能时，为避免搭建系统后出错以致无法使用进而浪费时间精力的情况发生，可以在搭建系统前使用各种仿真软件进行放真，如Multisim，Proteus。在仿真软件中，可以实时看到系统的运行状态，也可以实时对系统进行相应调整，极为方便。若在仿真过程中一切顺利，则在真实系统搭建起来后也大概率不会出现问题。但反观空间光学系统，并不存在好用的仿真软件，即使可以使用Comsol进行电磁场仿真，也只是能看到大概的局部电磁场效果，Zemax也只适用于几何光学成像系统的设计。这就使得使用者只能直接进行实验，而当实验过程中无法得到自己想要的结果时也无法明确是系统设计问题还是器件或者其他地方出现了问题，使得调试过程异常复杂且具有随机性。 最后也是最关键的便是器件的稳定性：电子元器件在生产出来后其功能基本会保持稳定不变，只需按照使用说明接通特定引脚便基本可以实现其设计时的预期指标。但光学器件并不是如此，以实验室里学姐使用的声光调Q器件为例，按照理论计算，调Q后脉宽应该至少压窄到20几纳米，但实际使用时至多能压窄到80纳米左右，反复调试依然无法继续压窄，原因不明。在使用电光调Q时，更是直接与理论不符，在不加电压时居然测出旋转一周出现三个非对称的通光极大值方向。器件的实际使用不稳定性大大增加了实验的难度。 以上种种使激光调制器件的使用难度指数级倍增，极大限制了其使用与普及。 3. 原因分析面对凡此种种，不禁会问，为什么会出现上述这些情况？ 我认为： 首先是发展较晚，继第二次工业革命之后，电子器件便雨后春笋般疯狂发展，在上世纪60年代集成电路兴起后更是直接走进千家万户。广泛的应用场景带来巨大的经济效益，使相关的研究更加投入。而光电子器件则没有如此良好的发展环境。 其次是理论成熟度的差异。关于电子的理论，如电容电阻电感以及各种有关电的效应早已为人们所熟知，而光子本身就是一个比较新的概念，激光更是上个实际60年代才被发明（同时期集成电路已经开始发展），两者理论的成熟度可以说是一个处于孩童或者至多青春期，另一个早已步入成年，甚至已走向晚年。 深刻剖析一下，以声光效应为例：关于声光效应的理论其实也很成熟，但为什么使用起来确如此繁琐呢？还会出现各种出人意料的问题？我觉得根本愿意还是稳定度不够，一个声光调Q包括声光换能器，声光晶体，水冷等装置。这其中有很多不稳定因素，如声光晶体会不会受温度的影响，晶体切角是否准确，换能器调制速度是否真的和预设的一致。这些都是隐性问题且不易察觉，察觉出后也不易更正。简单的说，就是器件使用条件很苛刻。为什么使用条件这么苛刻？我觉得主要原因在于难以检测。现在多数器件都是利用晶体的各类效应。晶体是长出来的，技术要求很高，且长出的晶体并不一定完全按照预期。前几日，学姐收到一块晶体，但经测试其相位匹配角发现，晶体切角并非预期切角。同样的事情很可能发生在成品器件中，其检测困难可能导致出现品质不合格的漏网之鱼。在使用时也可能因为温度或者功率的不同导致折射率偏离预期。更不用提有时会器件会设计固定的偏振方向，实际使用时入射偏振方向差一点便会引起巨大波动。也存在晶体在使用过程中被打坏，搬运过程中受外力影响被碰坏的可能。这些不稳定因素都导致了器件的使用难度直线上升。 归纳上述分析，我认为光电子器件如此难用最主要的原因在于难以找到一个稳定的工作介质（晶体），相关理论难以详尽描述各种实际使用时出现的状况，以致工作条件苛刻，最终导致器件的使用困难。 4. 解决办法我认为，解决问题的方向有两条： 一是找到稳定的工作介质 二是创造稳定的工作条件 关于第一个解决方向，最好的解决方式便是大力发展晶体学。这是最根本的解决方式但却不是最实际的方法。试想我们期待的完美工作介质需要具有：不受温度影响，对偏振方向不敏感，对切角不敏感，电光系数（声光系数）高…想找到这样的晶体无异于大海捞针。当然，现阶段也已经有很多相关研究。如在2017年有人提出了一种新型的KYW晶体^[1]^。此种KYW晶体具有很好的radiation resistance，经过计算，可以在特定工作角度上提高使衍射效率提高10倍左右(见下图)，进而省去了水冷系统的限制，拓展了使用场景。这样的对于晶体本身性能的改进会是一个循序渐进的过程，仍需要倾注大量人力物力。 ​ 新型KYW晶体制作的声光调制器与原始器件的对比 关于第二个解决方向也已经有很多相关研究。如通过使用两块取向相互垂直的KTP晶体消除梯度热场中热效应带来的折射率波动，使电光调制更加稳定，进而提升调制效率^[2]^。原本的衍射图像与经过重新系统设计后的衍射图像对比如下图所示，可以明显看出条纹的波动被消除。此类解决方案更多是对现有介质进行优化设计，通过系统结构的改进来增加稳定性。总体来说，成本较低，见效较快，是现阶段在晶体没有突破性进展之前应着重发展的方向。 原本的衍射图像 新系统的衍射图像 综合上述分析，或许真正的破局之道在于一边寻找晶体的突破以治本，一边寻找优化结构的方法解决燃眉之急。当工作介质晶体也像电子的常用基底——硅，一样稳定时，便是激光调制器件真正成熟之日。 三、总结本文站在使用者的视角，分析了激光调制器件难用的原因。并得出结论，即根本原因在于器件的稳定性差。接着对稳定性差的问题进行分析，提出两种解决方向，并结合现有文献对两个发展方向进行了分析与评价。最后对激光调制器件的发展进行展望，期待其和电子原件可同样稳定好用的一天的到来。 本人见识有限才疏学浅，以上分析全部建立于现有知识的基础之上，如有不当请斧正。 参考文献：[1] Acousto-optic modulators based on a KYW crystal[2] Electro-optical modulators based on KTP crystalsfor high-power lasers in the mid-IR region","categories":[],"tags":[{"name":"idea","slug":"idea","permalink":"https://zzyyqq2000.github.io/tags/idea/"}]},{"title":"光电子技术第二章","slug":"光电子技术第二章","date":"2021-10-29T01:31:01.000Z","updated":"2021-10-30T01:33:43.241Z","comments":true,"path":"2021/10/29/光电子技术第二章/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/%E5%85%89%E7%94%B5%E5%AD%90%E6%8A%80%E6%9C%AF%E7%AC%AC%E4%BA%8C%E7%AB%A0/","excerpt":"","text":"调Q技术2.1 调Q基本原理一、调Q目的1.目的：压缩脉冲宽度、提高峰值功率 脉冲宽度 峰值功率(1J) 类型 10^-3^~10^-4^s 10^3^~10^4^s 普通脉冲激光器 10^-8^~10^-9^s 10^8^~10^9^s 调Q激光器 2. 举例 激光测距仪 激光阴影成像仪 二、脉冲固体激光器的输出特性1. 特点a. 输出脉冲呈尖峰振荡（由许多振幅、脉宽、脉冲间隔做随机变化的尖峰脉冲组成）弛豫震荡b. 脉宽较宽，峰值功率低 2. 原因 激光谐振腔损耗不变，一旦光泵使反转粒子数超过阈值，便产生激光，上能级粒子数因受激辐射而减少，致使上能级无法积累大的反转粒子数。只能在阈值附近工作。 增大泵浦能量也无助于峰值功率的提高，只会是小尖峰的个数增加。 提高输入能量==并不能==有效提高峰值功率： 泵浦功率越大，尖峰脉冲形成越快，尖峰的时间间隔越小，尖峰个数增加，输出能量增加，但峰值功率提高不多。 氙灯亮度一定，增加输入能量则泵浦时间加长，脉冲宽度增大。而且输入能量也不能无限制提高：氙灯和工作物质有一最大负荷。 三、调Q基本原理 既然激光上能级的最大反转粒子数受激光器阈值的限制，那么，要使上能级积累大量的反转粒子，可通过提高激光器的阈值来实现。在泵浦初期，提高阈值，反转粒子数积累。反转粒子数积累到最大时，突然降低阈值，上能级粒子雪崩式跃迁到低能级，输出巨脉冲 1. Q值定义（Qualify Factor）Q值定义为，==谐振腔内储存的总能量与单位时间损耗的能量之比==。 Q = 2\\pi\\nu_0 \\frac{腔内储存的能量}{单位时间内损耗的能量} Q值是评价谐振器质量好坏的指标，称为谐振器的品质因数（Quality Factor） 设腔内储能为 W，腔的单程损耗率为 $\\delta$，腔长为L，介质折射率为n，则 Q = 2\\pi\\nu_0\\frac{W}{dW} = 2\\pi\\nu_0\\frac{W}{(\\delta W)/(nL/c)}=\\frac{2\\pi nL}{\\delta \\lambda_0}2. 调Q途径 Q =\\frac{2\\pi nL}{\\delta \\lambda_0}=2\\pi\\nu\\frac{L'}{\\delta c}=2\\pi\\nu\\tau_R可见，Q值与激光介质的折射率n，激光器腔长L，以及腔的损耗 $\\delta$有关。但在激光形成过程中n和L不易改变，所以只能改变损耗 $\\delta$ ==损耗大，Q值低，激光振荡阈值高，不易起振；损耗低，Q值高，激光振荡阈值低，容易起振。== 3. 调Q技术的原理 调Q技术就是通过某种方法控制腔的损耗，使谐振腔的Q值按照一定的程序变化的技术。 泵浦初期，使腔处于高损耗（低Q值）状态，即提高振荡阈值，使激光难以起振，上能级反转粒子数得以大量积累； 当上能级粒子数积累到最大值时，==突然==降低腔的损耗（提高Q值），激光振荡迅速建立，上能级粒子数雪崩式的跃迁到低能级，形成巨脉冲输出。 4. 调Q过程 能量储存过程：低Q，增益&lt;损耗，工作物质-谐振腔组合储能（反转粒子数上升） 激光产生与输出过程：高Q值，增益&gt;损耗（反转粒子数下降） Q值相当于一个开关Q值低，开关关闭，储能Q值高，开关打开，输出Q调制器，又称为Q开关 5. 调Q技术分类$\\delta$=$\\delta$~反射~+ $\\delta$~衍射~+$\\delta$~吸收~$\\delta$~反射~：机械转镜调Q，电光调Q$\\delta$~衍射~：声光调Q技术$\\delta$~吸收~：染料可饱和吸收调Q 6. 实现调Q对激光器的基本要求 工作物质抗损伤阈值高 上能级粒子寿命长：泵浦过程使上能级粒子增加，在没有产生受激辐射的情况下，自发辐射使上能级粒子减少，当两者平衡时就是上能级能够积累的最大粒子数。上能级寿命应该尽可能大，但不宜太大，否则会影响能量的释放速度固体、液体激光器均可以实现调Q。但气体激光器，如He-Ne，只能在低电离情况下工作，泵浦速率不能太大，无法实现调Q运转。 光泵速度必须快于激光上能级自发辐射速率，否则不能实现足够多的粒子数反转 谐振器的Q值改变要快，一般应与==激光振荡的建立时间==相比拟 2.2 调Q激光器的基本理论一、调Q的速率方程1. 三能级系统速率方程","categories":[],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://zzyyqq2000.github.io/tags/%E7%AC%94%E8%AE%B0/"}]},{"title":"光电子技术第一章","slug":"光电子技术第一章","date":"2021-10-29T01:30:46.000Z","updated":"2021-10-29T17:20:24.137Z","comments":true,"path":"2021/10/29/光电子技术第一章/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/29/%E5%85%89%E7%94%B5%E5%AD%90%E6%8A%80%E6%9C%AF%E7%AC%AC%E4%B8%80%E7%AB%A0/","excerpt":"","text":"假装我是摘要 第一节 调制的基本概念一、调制的目的与定义1. 调制的目的目的：将低频信号加载到高频载波上以利于信息的传递（可能会考） 2. 调制的定义定义：利用调制信号去改变载波的某一参数，使其按调制的信号规律变化的过程。 解释： 调制信号：要传递的信息要转化为电信号——调制信号 载波：信息载体。要频率高且固定 某一参数：可以是振幅，相位，频率等（只改一个） 调制信号的规律变化：载波的某一参数经调制后必须按调制信号的规律变化，否则失真 二、激光调制1. 激光调制 激光为载波的调制 （1）定义把信息加载到激光辐射上的过程 （2）特点高频调制，频带宽，理想载体 （3）激光调制与无线电波调制的异同？概念相同：相位调制、频率调制、振幅调制、脉冲调制结构不同：激光为高频调制，无线电为低频调制共同点：用非线性效应调制，即无线电波调制利用放大器的非线性效应调制，激光用电光、磁光，声光等非线性效应 （4）调制器想用家光完成通信就要把信息加载到激光上，完成这一过程的被称为调制器 （5）应用 实现信息加载——光信息技术：激光制导等 控制工作状态——调Q，锁模技术：产生超短脉冲等 2. 激光调制的分类（两种）（1）按调制器与激光器的相对位置分 内调制：在激光形成过程中，一调制信号改变激光震荡某一参数，即用调制信号控制着激光的形成（两种实现方式）（1） 用调制信号控制泵浦电流，如LD的调制-直接调制（2） 在谐振腔内放置调制器 ​ 优点：调制器需要激励功率小，调制效率高​ 缺点：有附加损耗，降低输出功率；调制器带宽受谐振腔通带的限制 外调制：调制器在激光腔外优点：不影响激光器的输出功率；不受谐振腔通带的限制。缺点：调制效率低。 （2）按调制的性质分激光的瞬间电场 : $ e_c(t) = A_c cos(\\omega_c t+\\phi_c) $ $A_c$——振幅调制/光强调制（$I = |A|^2$） $\\omega_c$——频率调制 $\\phi_c$——相位调制 若以脉冲激光作为载波： 脉冲调制 脉冲编码调制（数字式调制） 三、振幅调制和光强调制1. 振幅调制（调幅-AM）（1）定义：载波的振幅随着调制信号的规律发生变化的震荡调制前： $ e_c(t) = A_c cos(\\omega_c t+\\phi_c) $ (注：c-carrier为载波)调制后： $ e_c(t) = A_c(t) cos(\\omega_c t+\\phi_c) $调制后的振幅： $ A_c(t) = A_c+Ka(t) $$a(t)$为调制信号（信息），K为比例系数（调制灵敏度） 假设： $ a(t) = A_m cos(\\omega_m t) $ 注：m – modulate (调制) 调制后的电场： $ e_c(t)=(A_c+KA_m cos(\\omega_m t)) cos(\\omega_c t+\\phi_c) $","categories":[],"tags":[{"name":"笔记","slug":"笔记","permalink":"https://zzyyqq2000.github.io/tags/%E7%AC%94%E8%AE%B0/"}]},{"title":"paper translation","slug":"paper-translation","date":"2021-10-27T15:08:41.000Z","updated":"2021-10-29T13:08:34.029Z","comments":true,"path":"2021/10/27/paper-translation/","link":"","permalink":"https://zzyyqq2000.github.io/2021/10/27/paper-translation/","excerpt":"","text":"光声层析成像在生命科学中的实际应用摘要将宏观观测与微观发现紧密联系在一起的成像技术使生命科学受益匪浅。作为一种在多个空间尺度上都可以高速对光吸收对比度进行高灵敏度成像的技术，光声层析成像（photoacoustic tomography，PAT）在此方面优势尤为明显。在PAT中，内源性对比度揭示了生物组织的结构、功能、新陈代谢以及组织学方面的特性，外源性对比度则对应着分子和细胞的特异性。PAT技术可成像的空间尺度覆盖了细胞器、细胞、组织、器官以及小动物等层级。因此，PAT可与其他成像方式在对比机制、成像深度、时空分辨率等方面形成互补。我们回顾了PAT的基本原理并对如何让PAT满足特定科研需求提供了一些建议。我们也总结了PAT在生物医学领域中最有前景的应用，泰伦相关的风险与挑战，并对PAT可能带来的突破进行了畅想。 现代生物医学成像技术提供了从分子到解剖学各个层次的对生物体的完整展示，引发了生命科学的革新。纵观历史，这些成像技术通过更高的空间分辨率、更高的对比度、更高的成像速度、更深的成像深度以及更高的灵敏度，使人类以前所未有的信息丰富度，瞥见了复杂生物系统的奥秘。在宏观层面，包括磁共振、X光计算层析、超声成像在内的许多方式对解剖学层次实现了极佳的成像深度。正电子发射层析和单光子发射计算层析技术实现了对放射性标记分子探针的高穿透深度和高对比度成像。在微观层面，光学显微技术可以对表层深度上的生物现象进行亚细胞和亚细胞器分辨率的观察。然而，这些成像工具的不同成像对比机制以及尺寸大小限制了对生物问题进行相关性多尺度研究。因此，在生命科学领域很有必要找到一种可以从微观到宏观均可成像的技术。 在过去的十年里，PAT（也被称为光声或热声层析技术）已经被证明可利用同一套成像对比机制实现多尺度的成像；因此，它完美搭建起了微观与宏观的桥梁。PAT是一种混合成像模式，它利用光声效应（一种可以将所吸收的光能转化为超声能量的物理现象），通过检测超声信号进而探知光能吸收对比度。光学激发与超声探测的结合提供了3大优势。（1）PAT天然适合通过内源性对比度揭示了生物组织的结构、功能、新陈代谢以及组织学方面的特性，通过外源性对比度揭示分子和细胞的特异性。（2）因为就平均散射自由程而言，生物组织对声波的穿透性要比对光的穿透性高几个数量级，因此PAT比光学显微技术能提供更深得多的成像深度以及可调的空间分辨率。（3）PAT与其他的成像方式有很好的互补性和兼容性，尤其是和光学成像与超声成像。 历时一个多世纪，光声成像才从一个已知的物理现象发展成为有价值的成像方法。尽管广生效应早在1880年就被Bell在发明电话时发现，直到100年后Bowen才提出通过电力辐射（如高能量电子和X光子）或者非电离辐射（如辐射波和微波）的激发来利用此效应进行成像。他演示了使用辐射波实现的一维深度成像，但缺少了预期的侧向成像，在专利中也没有提到使用光激发的可能性。在20世纪90年代，相应的采用激光的一维深度成像技术问世。随着反重建与球聚焦超声探测器的引入，能同时实现轴向和纵向探测的2D、3D PAT最终被实现。在接下来的十年里，解剖学、功能、分子层次的PAT接连取得里程碑式进展。尤其是首个功能性光声计算层析（PACT）和光声显微（PAM）的出现极大刺激了这一领域的高速发展。 尽管一键式的商用PAT系统仍未出现在预临床实用领域，但使用者依旧从理解PAT的原理与特性中获益，尤其是在为某个特定应用选择并优化PAT系统时。在本篇回顾中，我们介绍了PAT的基本原理并着重强调其在预临床生命科学中解剖学以及分子层次的成像能力。我们通过案例向那些选择或自己搭建PAT系统来更好辅助他们科研工作的科学家提供了实用的指导方针，并且我们总结了最振奋人心的生物医学应用。同时我们也对将来可能出现的能够克服如今科技挑战的PAT成像模式进行了预测。 专栏1 PAT中的光源PAM和PACT对于最佳的光脉冲有不同的需求，区别通常在于脉冲的重复频率、单脉冲能量、脉宽以及波长的可调性。通常而言，PAM的关键是高重频，PACT的关键是高脉冲能量。就栅格扫描PAM（图2a-c）而言，为实现高速三维成像，脉冲的重复频率需要高于1kHz。例如，为了在0.1秒内实现对200×200个点的栅格进行扫描，脉冲的重复频率需要至少为400kHz。对于PACT（图2d-g），一个单脉冲即可实现2D或者3D的成像，10Hz的脉冲重频通常便足够使用。由于光激发区域相对较小，PAM通常采用比PACT（&gt;10mJ）更小能量脉冲（OR-PAM &lt;1$\\mu$J, AR-PAM &lt;1mJ）。对于PAM和PACT，两者所需的激光脉宽都需要小于声音穿过预期轴向分辨率长度的时间（纳秒量级）。最后，对于功能型和分子层次的PAT，激光波长需要可以调节以在不同波长下获得不同的图像。Nd:YAG泵浦的调Q OPO，钛宝石和燃料激光器最为常用，因为它们可以在生物相关波段提供纳秒量级的脉宽以及足够的脉冲能量。但很不幸，脉冲激光器通常笨重且昂贵。最近，有报道称可使用脉冲激光二极管^102^和发光二极管^103^作为小型化且更廉价的替代选项。然而，它们的脉冲能量即使成组使用依然很低（如堆叠多个激光二极管），这导致很低的信噪比。时间编码激发（如Golay码^103^）的引入可以以牺牲成像速度的代价提升信噪比。 PAT的基本原理尽管PAT已经被多个不同的应用方向定制使用，但它们的基本原理仍是一致的。它的成像过程的第一步通常都是向组织体发射一束短激光脉冲。随着光子穿过生物组织，一部分被生物分子吸收（如血红蛋白、DNA-RNA，脂质、水、黑色素和细胞色素）。PAT中不同的吸收机制包括但不限于电子吸收、震动吸收^16^、受激拉曼吸收^17^和表面等离子体共振吸收^18^。被吸收的光能通常部分或全部通过被激发分子的非辐射弛豫转化为热能（图1a）。由热引起的压力波以超声波的形式在组织体里传播。此超声波在体外被超声换能器或者换能器阵列接收并形成可描述原始组织内光吸收分布的图片。（图1b）PAT对于微小的光子收差异有100%的相对灵敏度，这意味着一定百分比的光学吸收常数变化会导致相同百分比的PA信号振幅变化。相比之下，基于背向散射的共聚焦显微镜对于血液中的光吸收的相对敏感度在500nm时只有6%，在800nm时只有0.08%。因为PAT不依赖于荧光（荧光通常会有低于100%的量子效率），它可以实现对所有分子的成像^15，19，20^。 PAT的主要实现方法典型的PAT系统主要组成部分包括：用来提供足够带宽PA信号（专栏 1）的短脉冲激光器（如纳秒Nd:YAG调Q激光器）；用来探测信号的宽带超声换能器或换能器阵列；用来将信号放大并且数字化的数据采集系统；用来实现系统同步、数据采集和图像生成的上位机。换能器的带宽需要和PA信号的带宽相匹配，此PA信号在所需深度由少量光吸收产生并经过频率相关的生物组织吸收。相匹配的宽带探测器可优化信噪比进而提升探测灵敏度以及轴向分辨率。 PAT已经被两种主要的成像方式实现。（图2）第一种方法——聚焦扫描成像多被用于PAM中，它主要采用机械结构扫描一束聚焦激光并使用单个超声换能器探头进行接收（图2a-c）。第二种方法多被用于PACT中，采用宽场照明以及多点探测进行图像重建（图2d-g）。PAT也可用于内窥检查领域^21-24^。由于PAT的高灵活性，不同成像方式的性能高度重叠，为方式之间相互切换提供了极大方便。除此之外，互补的原始成像方式之间可以实现不同的混合使用形式。更进一步，由于它综合利用了光的激发和声的探测，PAT可以和很多互补的成像方式相互兼容，尤其是和光学成像和超声成像^25^。 PAM可以被更进一步分为光学聚焦远小于声学聚焦的光学分辨PAM（OR-PAM）和声学聚焦远小于散射光束的声学分辨PAM（AR-PAM）（图2c）。这两种情况下的轴向分辨率都是由声学特性决定的。在OR-PAM中，由光学性质决定的横向分辨率远高于轴向分辨率。光学聚焦既可以很强也可以很弱，取决于所需的空间分辨率和穿透深度。相反地，在AR-PAM中，轴向分辨率通常远高于横向分辨率。 PACT可采用1D超声换能器阵列^26，27^（图2d，e），2D换能器阵列（图2f）^28，29^，或者其他通过扫描实现等价效果的方式（图2g）^11，30，31^。对于使用1D阵列的PACT，在成像平面上由重建过程得到的轴向（或径向）和横向（或切向）分辨率要好于由声学柱聚焦所决定的elevational分辨率。在成像平面上，轴向（或径向）是指沿着垂直于换能器表面的方向（即沿着声音的方向），而横向（或切向）指的是垂直于轴向（或径向）的方向。对于使用2D阵列的PACT，市场中心几乎可以实现各向同性的分辨率。与PAM相较而言，最先进的PACT通常可实现更高的成像速度与更深的穿透深度，但空间分辨率相对更低。 PAT的图像生成PAT的成像过程是通过对接收到的PA信号的时间利用音速进行数值计算反推出原始的空间位置信息。在PAM中（图2a-c），每个接收到的PA信号都是由最初的光学聚焦与声学聚焦中较小的那个产生的；通过提取射频PA信号的包络——振幅调制曲线，它被转化为一维的沿声音传播方向的光能沉积分布。在PACT中（图2d-g），每个超声换能器单元都能在很大角度上接收到PA信号并且所有阵元接收到的信号都会通过逆向球状雷达变换（类似于GPS中的三角测量法）被用于图像的重建。 取决于成像方法的不同，PAT可能需要机械或电子的扫描机制。对于通过单脉冲产生一维深度方向成像的PAM，需要通过二维网格式的扫描或任意路径的扫描来获取三维图像。对于使用一维阵列的PACT，单脉冲可产生二维横截面上的图像，需要引入沿着抬升方向的或者围绕物体的旋转轴方向的扫描以获得三维图像。对于使用二维换能器阵列的PACT，一个激光脉冲理论上可以产生三维图像；然而在实际应用中，通常会采用机械或电子的扫描方法以补充个数据。 PAT系统及其相匹配的引用一个特定的研究工作可能和某个特定的PAT最相匹配。在考察某研究与某种给定的PAT之间的匹配度时有三个典型问题需要考虑：（1）成像深度（2）成像速度或时间分辨率（3）成像对比度。为了找到解决某特定问题的最佳方法，人们可能需要考虑参数之间最优化的权衡。作为指导，图3根据这三条准则——深度、速度和所关注的对比度，总结了PAT的几种主要应用方式。 成像深度光子在软组织中的传播可以大致被分为四种，这决定了不同高分辨率光学成像模式的穿透深度限制（图4a）^34^。PAT的空间分辨率随着成像深度的变化而变化，其变化范围覆盖从准粒子轨迹状态（通常在组织中&lt;=1mm）到散射状态（通常在组织中&gt;10mm），最高可达耗散极限（在组织中~10cm）^35^。降低PAT的成像深度可使分辨率得到大概成比例的提升。作为经验法则，成像深度与分辨率的比例大约是200，这使得PAT在很大成像深度范围内均可实现较高的分辨率（图3）。 考虑到共聚焦显微镜和双光子显微镜在生命科学领域的流行，我们会展示这两种技术在成像深度上与PAM和PACT的比较结果（图4b）。共聚焦显微镜在生物组织中的成像深度被限制在100-200$\\mu$m的范围内，因为它依赖经过往返路线衰减后剩余的光子数。双光子显微成像通过使用长激发波长来提升成像深度，这可以减少光学衰减并可增强光学聚焦。然而，较低的双光子激发效率以及令人困惑的表面信号仍然将穿透深度限制在大约1.5mm左右。与双光子显微成像相比，出于一下两个原因，OR-PAM可以实现即使不大于也至少是相近的成像深度：（1）信号振幅与激发光强成线性相关而不是二次方并且检测中所遇到的声学衰减可近似忽略（2）时间分辨率较高的声学探测可有效抑制表面的干扰。然而，OR-PAM仍然依赖准粒子轨迹的光子来提供由光学性质决定的横向分辨率。如果空间分辨率的要求放开到10个微米左右的量级（可由高频超声探测器实现），AR-PAM可工作于准耗散模式（例如在50MHz下实现穿透深度约5mm^36^），在这种情况下大部分粒子经历了多轮散射。由于横向分辨率由声学性质决定，到达目标的准直和散射光子都对PA信号有贡献。AR-PAM的穿透深度很大程度上受限于高频的声学衰减而且在牺牲成比例的分辨率的情况下可被拓展至10mm。如果预期的分辨率可被放宽至几百微米的量级（可通过低频超声探测实现，如5MHz），PACT可工作于在活体展示中穿透深度高达70mm耗散模式^38^。然而，PACT仍受限于耗散极限，在软组织中穿透深度在10cm以下，此种情况下的光通量——单位面积上接收的光能（J/cm^2^）——由于散射和吸收被极大衰减。当光的散射效应可被波前工程技术^39^补偿时，或许可实现逼近吸收极限（~1m）的穿透深度并用于人体的全身成像（图4a）。 空间分辨率一旦所需的成像深度确定后，人们便可估算所能达到的最佳分辨率（图5a）。对于准粒子轨迹模式，OR-PAM更适合因为它能分辨到单细胞或者细胞器的层次（图5b，c）。OR-PAM对癌症血管生成类研究很有帮助，其新生血管直径普遍小于10$\\mu$m；也对以单细胞功能为研究目标的单细胞流量类研究很有益处。AR-PAM更多被用于准扩散模式。现已能实现约5mm的成像深度以及组织层次的空间分辨率（约50$\\mu$m的横向分辨率以及约15$\\mu$m的轴向分辨率）。对于扩散模式，现已实现小动物的全身深度成像，此种情况下更倾向于使用几百微米分辨率的PACT。 PAT的空间分辨率可以通过光学和声学的方法进行调节（图5a）。对于OR-PAM，短激发波长和更窄的光学聚焦可带来更高的横向分辨率，而且更宽的兆赫兹级超声探测带宽可带来更好的轴向分辨率。然而，值得注意的是，使用兆赫兹级带宽探测的OR-PAM的轴向分辨率处于几十微米量级。最近使用超宽带探测（千兆赫兹）的OR-PAM发展可提供大致各向同性的分辨率。然而，极高频超声的极强超声损耗限制了此方法只能用于单细胞的研究。对于AR-PAM，更高的超声带宽会提供更好的轴向分辨率，而且更高的超声中心探测频率可以带来更高的横向分辨率。进一步而言，更窄的声学聚焦以聚焦区域为代价将提高横向分辨率，聚焦区域定义为横向分辨率下降到1.4倍的深度范围。PACT的空间分辨率可以通过提高中心频率和超声换能器阵列带宽的方法进行提升。然而，在所有的情况中，空间分辨率的提升都是以牺牲穿透深度为代价。 最近，可以突破光学衍射极限的超分辨OR-PAM得以实现。不同的非线性机制被用于提升分辨率，包括光学饱和吸收（图5b）^42^，光热非线性效应^43^，双光子吸收^44^，纳米气泡空化^45^，热松弛或格鲁尼森弛豫^46^，光热漂白^47^，和可逆光开关^48^。正如共聚焦显微镜和双光子显微镜，非线性OR-PAM可自动实现光学七篇，这使轴向分辨率比传统线性OR-PAM中时分超声切片的轴向分辨率提升了至少10倍。 成像速度在很大跨度的时间尺度上都有不同的生物行为发生。PAT不同成像模式成像速度的范围跨度很大，每一种都会有相应的某种妥协（图3）。科学家需要选定某个具有特定成像速度的成像系统来使其他参数得到尽可能的优化。 对于OR-PAM（图2a，b），可以使用不同的扫描机制来得到想要的成像速度^49^。不想共聚焦和双光子显微镜，PAM不需要提供深度扫描来获得3D图像因为它的声音探测是时序的。当需要视频帧率三维成像时，激发光束可以在声学焦点内（直径50$\\mu$m）进行栅格式扫描，尽管这项技术会限制视场大小。约30Hz的三维成像主要受激光脉冲重复频率限制，已经被用于毛细血管中单个红细胞的成像。利用数字微镜阵列跳过背景直接对目标区域进行随机访问扫描的技术可以进一步提升丞相速率^50^。未聚焦的光声检测可以牺牲信号的振幅^51^来扩大视场范围——迄今为止所展示的最大直径~6mm。最近，使用水浸式微机电系统（MEMS）振镜的融合扫描技术可以同时聚焦操控激发光束和产生的声束，借此实现了约1Hz的成像速度，约3×4mm^2^的中等视场大小和未作任何妥协的探测灵敏度^52，53^。如果低维度成像即可满足需求，每减少一个维度大约可带来两个数量级的成像速度提升。 对于 AR-PAM（图2c），成像速度主要受限于机械扫描速度和高脉冲能量激光器的脉冲重频，后者受限于组织上激光照射的安全性。在AR-PAM中，通过步进电机或者音圈扫描仪的机械扫描结构通常扫描步长为OR-PAM中的~10倍。40Hz的二维成像速率已经在AR-PAM中实现，且拥有约9mm的扫描范围；这个速率足够捕捉小鼠心脏中一个心跳内的氧合动力学过程^36^。 对于可提供大视场角的PACT，成像速度通常受限于脉冲重频和多路数据采集所必须的时间。通过使用一维或二维超声换能器阵列，一个单脉冲理论上即可在整个视场下产生二维或三维图像。然而，通常用来降低成本的多路数据采集减缓了数据收集的速度。在PACT中采用的商用高脉冲能量激光器通常工作频率小于50Hz。除此之外，由于重复的宽场照明可能造成因热效应积累造成组织损伤，除了控制单脉冲的能量密度（J/cm^2^）需要被控制以外，功率密度（W/cm^2^）也需要被控制来防止损伤^54^。一个最近开发的PACT系统用半球状超声换能器阵列（256个单元）实现了~50Hz的三维成像，视场范围为15×15×7mm^3^（图2f），这足够对老鼠跳动的心脏和游动的斑马鱼的神经活动进行实时成像^28^。然而，由于换能器数量限制导致的稀疏的空间采样引起了中心视场外的成像伪影。对基于FP干涉仪（图2g）的PACT系统，空间分辨率可以用视场范围内密集的空间采样来维持，但成像速度会受限于光束点对点的扫描机制^30^。使用时间门控照明和高速CCD相机的干涉模式宽场探测预计可以加快成像速度^55，56^。 成像对比度以及灵敏度为了研究某种给定的生物现象，科学家通常需要使用具有理想对比度的方法来对现象进行高灵敏度或高定制化或者两者兼而有之的成像。因为PAT不依赖荧光，任何分子理论上可以使用PA对比度进行成像只要非辐射弛豫可以发生。内源性和外源性成像介质已经在PAT中被广泛探索^57，58^。 内源性造影剂有几个主要的优势：（1）无毒性（2）对生物过程的非干扰性（3）丰富性（4）监管批准随意使用。PAT中最常见的内源性成像介质包括DNA-RNA^59^，血红蛋白^31^，黑色素^40^，脂质^36^和水^60^（图3）。他们中血红蛋白通常被用于免标记血液动力学研究，在解剖学、功能性以及新陈代谢方面提供有关血管直径、总血红蛋白含量、血氧含量、血流量和氧代谢等方面的信息。 外源性成像介质与内源性相比有两个主要优势：（1）对跟高灵敏度的优化（2）与目标分子的结合（如抗体）使探测器的分子成像更具选择性。很多外源性成像介质——包括有机染料^61^，荧光蛋白^62^，非荧光蛋白^48^，以及纳米颗粒^63^——已经被高灵敏度PA分子成像广泛研究（图3）。 在定量的光谱PA成像中组织体连续被不同波段的光照明，这通常被用于区分不同光吸收类型所产生的信号（图6a）^64^。然而，要量化不同波段的光吸收通常需要其所在位置不同波段的荧光信息，这通常很难估计因为会有强烈但原因不明的与波长有光的光耗散现象，尤其是对于深层组织更为明显。其他因素，包括PA信号产生效率、非线性光吸收以及不均匀的光照明和声耗散都使量化过程更为复杂。最近，使用自适应滤波的统计解耦方法表现超过了传统的最小二乘方法，展示了对背景随机信号更强的鲁棒性^65^。然而，这些方法相更适合识别稀疏分布的吸收体而不是量化其浓度。至于更细节的讨论，读者可以参考有关量化光谱显微PA成像的逆变换方法更完整的回顾^64^。 为了在更深处获得更高的探测灵敏度，在红光或近红外波段拥有较大光吸收截面的成像介质更受青睐（图6b），正如同类型回顾中所述^58^。由于较大的颗粒尺寸或表面等离子体共振效应，纳米颗粒通常可提供较高的对比度因此被广泛应用于PAT的研究中^14^，尽管他们通常在血管中有很长的循环周期而且较难排出体外^66^。可基因编码的蛋白质（荧光或非荧光）在PA分子成像中越来越受欢迎因为他们能提供高选择性而且外部输送较为方便^15，20，62，67-71^。使用可激活纳米颗粒或光开关蛋白的创新方法已见诸报道（图6c）^48，72^，而且这些方法可以有效增强探测灵敏度。 为了进一步提高PA探测灵敏度（通常用成像介质的噪音等效可探测浓度量化），人们可以选择最大化目标信号振幅，抑制背景信号振幅，优化电子，减少噪音振幅。除了挑选具有较大光学吸收截面的成像介质外，加强光学荧光并且把激光波长调至吸收峰处也可以提升目标信号振幅，只要每个脉冲引起的温度升高在安全的范围内即可。美国国家标准协会（ANSI）已经对接触到眼睛与皮肤的激光设定标准^54^。在ANSI的限制中，PAT对于体内成像很安全，因为从升温到声压的转化效率高（即1mK的升温可导致800Pa可探测到的升压）。而且，令超声换能器与PA信号的频谱相匹配（通常受限于目标深度）可以使探测效率最大化。尽管传统压电超声换能器的灵敏度会随着尺寸的减小而降低，光学声波探测器的灵敏度（通常基于干涉）通常不会降低。因此对于高灵敏度PAE（超声换能器必须小型化），光学探测前景广阔。除了选择低噪音放大器外，PAT系统的电子期间可以通过超声换能器与后续放大电路的阻抗匹配进行优化。噪音水平可通过缩短电缆，放大器接地，屏蔽外界干扰来进一步降低。 应用PAT在生命科学中已被广泛应用，尤其在功能性脑电图、癌症检测、组织工程、发展生物学以及细胞科学等方面，这在其他地方已经被详细描述^19^。在此，我们仅挑选几个具有代表性的应用，PAT在其中已扮演越来越重要的角色。我们在图表1中也重点强调了两个案例。 PAT在微观和宏观尺度上均已实现功能性和代谢性脑部成像，为脑血管系统^73^，氧化过程（图7a）^27^，葡萄糖以及氧气代谢^74^，静息状态连接^75^以及大脑对多种生理病理挑战的应对^76-78^等方面提供了宝贵的信息。PAT可以提供神经元成像，既可以使用脂质作为内源性成像介质也可以使用染料^79^作为外源性成像介质。除此之外，PAT越来越多被用于研究小动物类脑部疾病，包括中风^80^，羊癫疯^81^，以及浮肿^60^。最近，轻量级头戴式PACT系统已被开发，成为向自由移动生物的功能性PA脑部成像迈进的重要一步^82^。 高分辨率单细胞成像在细胞生物学中尤为重要。OR-PAM拥有亚微米到微米级别的分辨率，非常适合对单细胞的形态与功能进行成像^83^。对于单细胞形态学，OR-PAM可以不用对细胞核内的DNA和RNA以及细胞质内的细胞色素进行染色，便可实现体内组织学成像。使用具有极高频率的超声换能器(&gt;1GHz), OR-PAM已经揭示了病变红细胞形态上的异常并且可以通过PA信号频率特征^41，84，85^来区分红细胞种类。对于细胞的功能，PA血氧定量法能实现体内无标记单细胞氧气排放成像（图7b）^86^。PA流量检测可以通过内源性成像介质以很高的灵敏度和流通量检测到在血管中循环的肿瘤细胞（如黑色素^40，87^）或者目标外源性成像介质（如目标为乳腺癌细胞的金纳米颗粒^18^）。 PAT广泛被应用于癌症研究领域中^88^，包括致癌作用的基础研究^89^，癌症检测和分期，和癌症治疗中的指导与评估^90^。特别地，PAT尤其适合对黑色素癌细胞进行无标记成像，因为黑色素癌细胞的黑色素作为天然的成像介质对红色和近红外光谱区的光吸收比红细胞高好几个数量级。OA-PAM可以分辨黑色素细胞中的单个黑色素小体^42^，AR-PAM可以检测小动物脑部深处的黑色素发展^91^，并且PACT已经成功的对转基因癌细胞进行成像，此癌细胞加入了酪氨酸酶基因标志物（图7c）^70^，可以表达高浓度的黑色素。对于自身缺乏高对比度颜料的癌症，靶向纳米颗粒或者有机燃料可以通过选择性地与癌细胞表面受体结合提供外源性成像介质^13，96，97^。癌细胞中不正常的氧气和葡萄糖代谢以及主要的癌症标志，已经各自被PAT使用内源性和外源性成像介质研究过^74，96^。 专栏2 PAT中面临的工程挑战正如上述讨论中所说，当把PAT系统应用于某个具体的生命科学研究中时，主要的组成部分，例如光源、超声探测系统、和扫描系统需要根据所需的成像表现具体选择。几个PAT应用中的工程挑战值得关注。对于OR-PAM，主要的挑战在于声学探测聚焦与光学激发聚焦的准直。通过使用低数值孔径（NA）的光学聚焦透镜^49^，不同的光声整合器已经被开发出来以实现共聚焦准直。暗场光学激发和暗场声学探测也已经被用于共聚焦准直^59^。然而，这项挑战对于高NA（&gt;0.6）光学聚焦透镜的反射式OR-PAM仍然存在，它的工作距离非常有限（128通道）已商业化，但是价格昂贵。多通道声学波导和单通道信号检测系统或许可以减少PACT的复杂度和开销^106^。 展望PAT发展的强劲势头来源于它在生命科学领域日渐流行的应用以及在预临床和临床研究中的商业化。几个较为典型的工程挑战已经在专栏2中列出。为了充分挖掘PAT的潜力，微米面对很多技术难题，但没有一个是无法解决的。（1）单个PAT系统若能集成多尺度成像并实现自动成像校准，其价值无法估量。主要的挑战在于不同成像深度所需的不同光照与声学探测的无缝整合。光学透明的超声换能器或换能器阵列或许可以简化系统配置。（2）小型化PAT系统对研究自由运动的动物成像，尤其是对于脑部研究，具有巨大意义。小型超声换能器相对较低的灵敏度以及选择不多的快速扫描机制目前是最大的掣肘。高速宽场声压光探测器或许是一个解决办法。（3）研究树突棘等亚细胞结构仍需要可实现精度高于50nm的超分辨PA技术。这样的技术可以用于对荧光或非荧光小分子进行超分辨成像。目前已有的非线性PA技术的信噪比仍然不够用于在高速状态下提供如此高的分辨率。类似手机辐射损耗显微镜（STED）的圈状照明方法具有提高分辨率的潜力。（4）分子生物学对PAT的单分子探测有很大需求。具有高压电转化效率和低声阻抗的新型超声探测器有待研发。（5）对深层组织的氧化与温度通过PA进行精确定量测量仍有很大困难，主要因为目标处光学荧光未知，以及其他次生因素的干扰，如与组织本身相关的PA产生效率。需要新的成像方式以及数值计算方法来更好描绘组织的光学特征。（6）最后，对于脑部深处的神经活动成像PAT系统，需要从自然界中寻找或根据已有蛋白质设计新型的基因可编辑的在近红外光谱区具有大吸收截面的可用于动作电位或替代指标（如电压或钙敏感蛋白质）检测的指示剂。沿着这个思路，非荧光近红外光敏色素（如RpBphP）或许可以改造成PA成像介质来显示动作电位。由头骨，尤其是内侧头骨，引起的强烈的声学吸收和相差对于单神经元PAT脑部深度成像而言优势一项挑战。一个潜在的对此问题的解决方法是集成PAT和X光CT，这可以为头骨的精确三维建模提供光学修正参数。 PAT为生命科学提供了完备的工具包，在成像机制、时空分辨率、穿透深度上与其他方法互为补充。我们期待PAT可以在生物医学研究中找到更有意义的应用。","categories":[],"tags":[{"name":"论文翻译","slug":"论文翻译","permalink":"https://zzyyqq2000.github.io/tags/%E8%AE%BA%E6%96%87%E7%BF%BB%E8%AF%91/"}]}],"categories":[],"tags":[{"name":"test","slug":"test","permalink":"https://zzyyqq2000.github.io/tags/test/"},{"name":"踩坑","slug":"踩坑","permalink":"https://zzyyqq2000.github.io/tags/%E8%B8%A9%E5%9D%91/"},{"name":"idea","slug":"idea","permalink":"https://zzyyqq2000.github.io/tags/idea/"},{"name":"笔记","slug":"笔记","permalink":"https://zzyyqq2000.github.io/tags/%E7%AC%94%E8%AE%B0/"},{"name":"论文翻译","slug":"论文翻译","permalink":"https://zzyyqq2000.github.io/tags/%E8%AE%BA%E6%96%87%E7%BF%BB%E8%AF%91/"}]}